amd-cloud/logs/atom/sweep_20260814_164903/c2.log
[atom 16:53:56] Raised RLIMIT_NOFILE soft limit 1024 -> 65535 (hard=524288)
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]
  0%|          | 0/4 [00:00<?, ?it/s]Namespace(backend='vllm', base_url='http://localhost:8002', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=2, model='/model', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir=None, result_filename='/out/c2.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=4)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=828   max=1014  mean=918.15   avg_token_mismatch=0.00  
 output_lens: min=828   max=1016  mean=935.25  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 4 requests...
100%|██████████| 4/4 [00:41<00:00, 10.29s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
100%|██████████| 20/20 [03:34<00:00, 10.74s/it]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     20        
Benchmark duration (s):                  214.88    
Total input tokens:                      18363     
Total generated tokens:                  18705     
Request throughput (req/s):              0.09      
Output token throughput (tok/s):         87.05     
Total Token throughput (tok/s):          172.50    
Concurrency:                             1.99      
---------------Time to First Token----------------
Mean TTFT (ms):                          278.93    
Median TTFT (ms):                        251.55    
P99 TTFT (ms):                           446.17    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.63     
Median TPOT (ms):                        22.58     
P99 TPOT (ms):                           22.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.61     
Median ITL (ms):                         22.41     
P99 ITL (ms):                            26.66     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          21422.69  
Median E2EL (ms):                        21639.79  
P99 E2EL (ms):                           23423.70  
==================================================